app/views/cocktails/show.html.erb

SELECT  1 AS one FROM "doses" WHERE "doses"."cocktail_id" = $1 LIMIT $2  [["cocktail_id", 1], ["LIMIT", 1]]
SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 43]]
---

      <% if @cocktail.doses.any? %>