app/controllers/cocktails_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cocktail = Cocktail.find(params[:id])

INSERT INTO "cocktails" ("name", "created_at", "updated_at", "photo") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Batman"], ["created_at", "2017-11-24 15:56:33.137067"], ["updated_at", "2017-11-24 15:56:33.137067"], ["photo", "cv3onnshntcohstuqpfw.png"]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save